fangling107/GL3150_V1.0/STM32_GL008A_CLJ260_V1.0/USER/src/RA8870.c
#include "rtc.h" 
#include "ra8870.h"
#include "touch.h"
#include "stdio.h"
#include "stdlib.h"
#include "string.h"
#include "picture.h"
#include "stm32f10x.h"
#include "stm32f10x_fsmc.h"
//////////////////////////////////////////////////////////////////////////////////	 
//4.3寸 TFT液晶驱动	  	
//********************************************************************************	 

char Data[10];//日期
char Time[8];//时间

//延时1us子程序
void Delay1us(void)
{
	u8 i;
	for(i=10;i>0;i--);	
}	
//延时1ms子程序
void Delay1ms(u16 x)
{
	u16 i,j;
	for(i=x;i>0;i--)
		for(j=12000;j>0;j--);	
}		   
//写寄存器函数
//regval:寄存器值
void LCD_WR_REG(u8 regval)
{ 
	LCD_REG=regval;//写入要写的寄存器序号	 
}
//写LCD数据
//data:要写入的值
void LCD_WR_DATA(u8 data)
{										    	   
	LCD_RAM=data;		 
}
//读LCD数据
//返回值:读到的值
u8 LCD_RD_DATA(void)
{	
	u8 ram=0;	
	ram=LCD_RAM;
	return ram;		 
}	
u8 LCD_ReadStatus(void)
{
	u8 stat=0;
	stat=LCD_REG;
	return stat;

}  
//读寄存器
//LCD_Reg:寄存器地址
//返回值:读到的数据
u8 LCD_ReadReg(u8 LCD_Reg)
{										   
	LCD_WR_REG(LCD_Reg);		
	Delay1us();		  
	return LCD_RD_DATA();	
}   


//系统时钟设置
void RA8870_PLL_ini(void)
{
		LCD_WR_REG(0x88);
		//Delay1us();
		LCD_WR_DATA(0x0B);      
    Delay1ms(100); //After REG[88h] or REG[89h] is programmed, a lock time (< 30us) must be kept to guarantee the stability of the PLL output. After the lock time period, a software reset must be asserted and user must re-program the RA8870 to complete the procedure
    LCD_WR_REG(0x89);
		//Delay1us();
		LCD_WR_DATA(0x03); 
    Delay1ms(100); //After REG[88h] or REG[89h] is programmed, a lock time (< 30us) must be kept to guarantee the stability of the PLL output. After the lock time period, a software reset must be asserted and user must re-program the RA8870 to complete the procedure
    LCD_WR_REG(0x01);
		//Delay1us();
		LCD_WR_DATA(0x01);	
    LCD_WR_DATA(0x00);
    Delay1ms(100);
}
//初始化lcd
void LCDRA8870_Init(void)
{ 	
	RA8870_PLL_ini();

	LCD_WR_REG(0x04); //PCLK    
	LCD_WR_DATA(0x80);
	Delay1ms(100);
	LCD_WR_REG(0x10);	
	LCD_WR_DATA(0x3c);//64K 外部SRAM
	Delay1ms(100);
	LCD_WR_REG(0x11);
	LCD_WR_DATA(0x00);//RGB
	Delay1ms(100);	 
	
	LCD_WR_REG(0x12);	 //IOCR  GPIO& analog TFT interface
	LCD_WR_DATA(0x00); //

	LCD_WR_REG(0x13);	 //IODR  GPIO
	LCD_WR_DATA(0x05);
	
//Horizontal set
	LCD_WR_REG(0x14);	
	LCD_WR_DATA(0x3B);
	
	LCD_WR_REG(0x15);	
	LCD_WR_DATA(0x00); 
	
	LCD_WR_REG(0x16);	
	LCD_WR_DATA(0x00);
	
	LCD_WR_REG(0x17);
	LCD_WR_DATA(0x00);
	
	LCD_WR_REG(0x18);	
	LCD_WR_DATA(0x03);

	LCD_WR_REG(0x19);
	LCD_WR_DATA(0x0f);	
	LCD_WR_REG(0x1a);
	LCD_WR_DATA(0x01);	
	LCD_WR_REG(0x1b);
	LCD_WR_DATA(0x00);	
	LCD_WR_REG(0x1c);
	LCD_WR_DATA(0x00);	
	LCD_WR_REG(0x1d);
	LCD_WR_DATA(0x00);	
	LCD_WR_REG(0x1e);
	LCD_WR_DATA(0x00);	
	LCD_WR_REG(0x1f);	
	LCD_WR_DATA(0x01);	
	LCD_WR_REG(0x28);  //if use font ROM Speed setting
	LCD_WR_DATA(0x04);	
	LCD_WR_REG(0x40);  //绘图模式
	LCD_WR_DATA(0x00);
	LCD_WR_REG(0x41);  //绘图模式
	LCD_WR_DATA(0x00);
	Display_ON();
	Clear_Full_Window();	
	Memory_Clear_with_Font_BgColor();
	Text_Background_Color(0xFF);//	
	Memory_Clear();	
	Delay1ms(100);
}
//STATUS 
void Chk_Busy(void)
{
	u8 temp; 	
	do
	{
	temp=LCD_StatusRead();
	}while((temp&0x80)==0x80);		   
}
void Chk_Busy_BTE(void)
{
	u8 temp;
   	
	do
	{
     temp=LCD_StatusRead();
	}while((temp&0x40)==0x40);	   
}	
void Display_ON(void)
{
	u8 temp;

	LCD_WR_REG(0x01);//PWRR
	temp = LCD_RD_DATA();
	temp |= 0x80;
	LCD_WR_REG(0x01);//PWRR
	LCD_WR_DATA(temp);
}


void Display_OFF(void)
{
	u8 temp;

	LCD_WR_REG(0x01);//PWRR
	temp = LCD_RD_DATA();
	temp &= 0x7f;
	LCD_WR_REG(0x01);//PWRR
	LCD_WR_DATA(temp);
}

//工作窗口的设定
void Active_Window(u16 XL,u16 XR ,u16 YT ,u16 YB)
{
	
    //setting active window X
	
  LCD_REG=(0x30);//HSAW0
	LCD_RAM=(XL);
	  
  LCD_REG=(0x31);//HSAW1	   
	LCD_RAM=(XL>>8);

	
  LCD_REG=(0x34);//HEAW0
	LCD_RAM=(XR);
	  
  LCD_REG=(0x35);//HEAW1	   
	LCD_RAM=(XR>>8);

    //setting active window Y
	 
  LCD_REG=(0x32);//VSAW0
	LCD_RAM=(YT);
	
  LCD_REG=(0x33);//VSAW1	   
	LCD_RAM=(YT>>8);


  LCD_REG=(0x36);//VEAW0
	LCD_RAM=(YB);
	
  LCD_REG=(0x37);//VEAW1	   
	LCD_RAM=(YB>>8);
}
//绘制矩形
void Geometric_Coordinate(u16 XL,u16 XR ,u16 YT ,u16 YB)
{ 
  LCD_REG=(0x91);
	LCD_RAM=(XL);
 
  LCD_REG=(0x92);	   
	LCD_RAM=(XL>>8);

 
  LCD_REG=(0x95);
	LCD_RAM=(XR);
   
  LCD_REG=(0x96);	   
	LCD_RAM=(XR>>8);
	   
  
  LCD_REG=(0x93);
	LCD_RAM=(YT);
	  
  LCD_REG=(0x94);	   
	LCD_RAM=(YT>>8);

	 
  LCD_REG=(0x97);
	LCD_RAM=(YB);
	 
  LCD_REG=(0x98);	   
	LCD_RAM=(YB>>8);
}
//设定全屏刷屏
void Clear_Full_Window(void)
{
	u8 temp;
	LCD_WR_REG(0x8e);//MCLR
	temp = LCD_RD_DATA();
	temp &= 0xbf;
	LCD_WR_REG(0x8e);//MCLR
	LCD_WR_DATA(temp);  
}
//选择文字背景刷屏
void Memory_Clear_with_Font_BgColor(void)
{
	u8 temp;
	LCD_WR_REG(0x8e);//MCLR
	temp = LCD_RD_DATA();
	temp |= 0x01;
	LCD_WR_REG(0x8e);//MCLR
	LCD_WR_DATA(temp);  
}
//设置文字背景色
void Text_Background_Color(u8 color)
{	
  LCD_REG=(0x43);//TBCR
	LCD_RAM=(color);
}
//设置文字显示位置
void XY_Coordinate(u16 X,u16 Y)
{
	u8 temp;

	temp=X;   
    LCD_REG=(0x46);
	LCD_RAM=(temp);
	temp=X>>8;   
    LCD_REG=(0x47);	   
	LCD_RAM=(temp);

	temp=Y;   
    LCD_REG=(0x48);
	LCD_RAM=(temp);
	temp=Y>>8;   
    LCD_REG=(0x49);	   
	LCD_RAM=(temp);
}
//REG[40h]
void Graphic_Mode(void)
{	u8 temp;
	LCD_REG=(0x40);//MWCR0
	temp = LCD_RAM;
	temp &= 0X7F ;
	LCD_RAM=(temp);
}
//
void Text_Foreground_Color(u8 color)
{	 
  LCD_REG=(0x42);//TFCR
	LCD_RAM=(color);
}

void BTE_Source_Destination	(u16 SX,u16 DX ,u16 SY ,u16 DY)
{
	u8 temp,temp1;
    
	temp=SX;   
    LCD_REG=(0x54);//HSBE0
	LCD_RAM=(temp);
	temp=SX>>8;   
    LCD_REG=(0x55);//HSBE1	   
	LCD_RAM=(temp);

	temp=DX;   
    LCD_REG=(0x58);//HDBE0
	LCD_RAM=(temp);
	temp=DX>>8;   
    LCD_REG=(0x59);//HDBE1	   
	LCD_RAM=(temp); 
    
	temp=SY;   
    LCD_REG=(0x56);//VSBE0
	LCD_RAM=(temp);
	temp=SY>>8;   
    LCD_REG=(0x57);//VSBE1
	temp1 = LCD_RAM;
    temp=temp|temp1; 
	LCD_REG=(0x57);//VSBE1  
	LCD_RAM=(temp);


	temp=DY;   
    LCD_REG=(0x5a);//VDBE0
	LCD_RAM=(temp);
	temp=DY>>8;   
    LCD_REG=(0x5b);//VDBE1
	temp1 = LCD_RAM;
	temp=temp|temp1;	
	LCD_REG=(0x5b);//VDBE1   
	LCD_RAM=(temp);
}				

void BTE_Size_setting(u8 width,u8 height)
{	u8 temp;
	temp=width;   
    LCD_REG=(0x5c);//BEWR0
	LCD_RAM=(temp);
	temp=width>>8;   
    LCD_REG=(0x5d);//BEWR1	   
	LCD_RAM=(temp);

