fangling107/GL3150_V1.0/STM32_GL008A_CLJ260_V1.0/USER/src/RA8870.c
	temp=height;   
    LCD_REG=(0x5e);//BEHR0
	LCD_RAM=(temp);
	temp=height>>8;   
    LCD_REG=(0x5f);//BEHR1	   
	LCD_RAM=(temp);
}		
								 
//---------------------------------------------//
//---------------------------------------------//
void BTE_Background_red(u16 color)
{	u8 temp;   
	temp=color;   
    LCD_REG=(0x60);//BGCR0
	LCD_RAM=(temp);
}							
//---------------------------------------------//
//---------------------------------------------//
void BTE_Background_green(u16 color)
{	u8 temp;   
	temp=color;   
    LCD_REG=(0x61);//BGCR1
	LCD_RAM=(temp);
}							  
//---------------------------------------------//
//---------------------------------------------//
void BTE_Background_blue(u16 color)
{	u8 temp;  
	temp=color;   
    LCD_REG=(0x62);//BGCR2
	LCD_RAM=(temp);
} 							

//---------------------------------------------//
//---------------------------------------------//
void BTE_Foreground_red(u16 color)
{	u8 temp; 
	temp=color;   
    LCD_REG=(0x63);//FGCR0
	LCD_RAM=(temp);
}								 
//---------------------------------------------//
//---------------------------------------------//
void BTE_Foreground_green(u16 color)
{	u8 temp;
	temp=color;   
    LCD_REG=(0x64);//FGCR1
	LCD_RAM=(temp);
}							 
//---------------------------------------------//

//---------------------------------------------//
void BTE_Foreground_blue(u16 color)
{
	u8 temp;
	temp=color;   
    LCD_REG=(0x65);//FGCR2
	LCD_RAM=(temp);
} 		
//清除显存
void Memory_Clear(void)
{
	u8 temp;
	LCD_REG=(0x8e);//MCLR
	temp = LCD_RAM;
	temp |= 0x80;
	LCD_REG=(0x8e);//MCLR
	LCD_RAM=(temp);
	Chk_Busy();
}
//启动画直线
void Draw_line(void)
{ 
  LCD_WR_REG(0x90);//DCR
  LCD_WR_DATA(0x80);
}
//启动画长方形
void Draw_square(void)
{
  LCD_REG=(0x90);//DCR
  LCD_RAM=(0x90);
}

//启动方形填充
void Draw_square_fill(void)
{
  LCD_REG=(0x90);//DCR
  LCD_RAM=(0xb0);
}
void Draw_circle(void)
{
 LCD_REG=(0x90);//DCR
 LCD_RAM=(0x40);
 Chk_Busy();
}
void Draw_circle_fill(void)
{
  LCD_REG=(0x90);//DCR
  LCD_RAM=(0x60);
  Chk_Busy();
}
//文本模式设定
void Text_Mode(void)
{
	u8 temp;

	LCD_REG=(0x40);//MWCR0
	temp = LCD_RAM;
	temp |= 0X80 ;
	LCD_REG=(0x40);//MWCR0
	LCD_RAM=(temp);	 
}
void Show_Cursor(void)
{
	LCD_REG=(0x02);
	LCD_RAM=(0x10);
	Chk_Busy();
}

void Del_Cursor(void)
{
	LCD_REG=(0x02);
	LCD_RAM=(0x00);
	Chk_Busy();
}
/**************************************************************************************
函数功能：画矩形
输入：    矩形的左上角和右下角坐标，和目标颜色
		  x1,y1  左上角坐标
		  x2,y2  右上角坐标
		  fill	 0  画矩形框
		  		 1  矩形填充
输出：	  无
**************************************************************************************/
void LcdFillRec(u16 x1, u16 y1, u16 x2, u16 y2, u8 fill, u8 color)
{
	Active_Window(0,480,0,272);	
	Text_Foreground_Color(color); // 设定颜色
	Geometric_Coordinate(x1,x2,y1,y2); // 设定矩形坐标
	LCD_REG=(0x90);
	if (fill)
	{
		LCD_RAM=(0xB0);
	}
	else
	{
		LCD_RAM=(0x90);
	}
	Chk_Busy();
}

/**************************************************************************************
函数功能：画矩形方框,立体感的组合形式
输入：    矩形的左上角和右下角坐标，和目标颜色
输出：	  无
(x1,y1)左上角坐标 (x2,y2)右下角坐标
color:前景色 bcolor:背景色
mode:1 字体加粗 0 不加粗
max:放大倍数
**************************************************************************************/
void LcdPrintRecZuHe(u16 x1, u16 y1, u16 x2, u16 y2, char *str1,u8 color,u8 bcolor,u8 mode,u8 max)
{
	LcdFillRec(x1+1, y1+8+1, x2+1, y2+1, 0, color);
	LcdFillRec(x1,   y1+8,   x2,   y2,   0, color);	
	Text_Mode();
	Text_Foreground_Color(color);
	Text_Background_Color(bcolor);//设定文字的前景色和背景色	
	External_CGROM();
	External_CGROM_GB();	
	XY_Coordinate(x1+10,y1);
	if(mode) Bold_Font();//mode=1 字体加粗
	if(max==2) 
	{
		Horizontal_FontEnlarge_x2();
    Vertical_FontEnlarge_x2();
	}
	else if(max==3)
	{
		Horizontal_FontEnlarge_x3();
    Vertical_FontEnlarge_x3();
	}
	else
	{
		Horizontal_FontEnlarge_x1();
    Vertical_FontEnlarge_x1();
	}
	Show_String(str1);
	NoBold_Font();//取消字体加粗	
	Horizontal_FontEnlarge_x1();
  Vertical_FontEnlarge_x1();//取消放大倍数
	Chk_Busy();
}
//选择外部CGROM
void External_CGROM(void)
{
	u8 temp;

	LCD_REG=(0x21);//FNCR0
	temp = LCD_RAM;
	temp |= 0x20 ;
	LCD_REG=(0x21);//FNCR0
	LCD_RAM=(temp);
}
void  ASCII_Mode_disable(void)
{
	u8 temp;

	LCD_REG=(0x21);//FNCR0
	temp = LCD_RAM;
	temp &= 0xef ;
	LCD_REG=(0x21);//FNCR0
	LCD_RAM=(temp);
}

void ASCII_Mode_enable(void)
{
	u8 temp;

	LCD_REG=(0x21);//FNCR0
	temp = LCD_RAM;
	temp |= 0X10 ;
	LCD_REG=(0x21);//FNCR0
	LCD_RAM=(temp);
}
void External_CGROM_GB(void)
{
	u8 temp;

	LCD_REG=(0x21);//FNCR0
	temp = LCD_RAM;
	temp &= 0xf3 ;
	LCD_REG=(0x21);//FNCR0
	LCD_RAM=(temp);
}
//显示字符串
void Show_String(char *str)
{  
	 Text_Mode();
	LCD_REG=(0x02);
	while(*str != '\0')
	{
	 LCD_RAM=(*str);
	 ++str;	 	
	 Chk_Busy();		
	}
 Chk_Busy();
}

//显示指定长度的字符串
void Show_StringNum(char *str,u8 len)
{  
	u8 len1=0;
	 Text_Mode();
	LCD_REG=(0x02);
	while((*str != '\0')&&(len1!=len))
	{
	 LCD_RAM=(*str);
	 ++str;
	 len1++;			
	 Chk_Busy();		
	}
 Chk_Busy();
}
void Horizontal_FontEnlarge_x1(void)
{
	u8 temp;

	LCD_REG=(0x22);//FNCR1
	temp = LCD_RAM;
	temp &= 0xf3 ;
	LCD_REG=(0x22);//FNCR1
	LCD_RAM=(temp);
}
void Horizontal_FontEnlarge_x2(void)
{
	u8 temp;

	LCD_REG=(0x22);//FNCR1
	temp = LCD_RAM;
	temp &= 0xf3 ;
	temp |= 0x04 ;
	LCD_REG=(0x22);//FNCR1
	LCD_RAM=(temp);
}
void Horizontal_FontEnlarge_x3(void)
{
	u8 temp;
	LCD_REG=(0x22);//FNCR1
	temp = LCD_RAM;
	temp &= 0xf3 ;
	temp |= 0x08 ;
	LCD_REG=(0x22);//FNCR1
	LCD_RAM=(temp);
}
void Vertical_FontEnlarge_x1(void)
{
	u8 temp;

	LCD_REG=(0x22);//FNCR1
	temp = LCD_RAM;
	temp &= 0xfc ;
	LCD_REG=(0x22);//FNCR1
	LCD_RAM=(temp);
}
void Vertical_FontEnlarge_x2(void)
{
	u8 temp;

	LCD_REG=(0x22);//FNCR1
	temp = LCD_RAM;
	temp &= 0xfc ;
	temp |= 0x01 ;
	LCD_REG=(0x22);//FNCR1
	LCD_RAM=(temp);
}
void Vertical_FontEnlarge_x3(void)
{
	u8 temp;

	LCD_REG=(0x22);//FNCR1
	temp = LCD_RAM;
	temp &= 0xfc ;
	temp |= 0x02 ;
	LCD_REG=(0x22);//FNCR1
	LCD_RAM=(temp);
}
void Font_with_BackgroundTransparency(void)
{
	u8 temp;

	LCD_REG=(0x22);//FNCR1
	temp =LCD_RAM;
	temp |=0X40 ;
	LCD_REG=(0x22);//FNCR1
	LCD_RAM=(temp);
}
void Font_with_BackgroundColor(void)
{
	u8 temp;

	LCD_REG=(0x22);//FNCR1
	temp = LCD_RAM;
	temp &= 0xbf ;
	LCD_REG=(0x22);//FNCR1
	LCD_RAM=(temp);
}
void NoBackgroundColor(void)
{
	u8 temp;

	LCD_REG=(0x22);//FNCR1
	temp = LCD_RAM;
	temp |= 0x40;
	LCD_REG=(0x22);//FNCR1
	LCD_RAM=(temp);
}
void BackgroundColor(void)
{
	u8 temp;

	LCD_REG=(0x22);//FNCR1
	temp = LCD_RAM;
	temp &= 0xBF;
	LCD_REG=(0x22);//FNCR1
	LCD_RAM=(temp);
}
void NoBold_Font(void)
{
	u8 temp;

	LCD_REG=(0x22);//FNCR1
	temp = LCD_RAM;
	temp &= 0xdf ;
	LCD_REG=(0x22);//FNCR1
	LCD_RAM=(temp);
}

void Bold_Font(void)
{
	u8 temp;

	LCD_REG=(0x22);//FNCR1
	temp = LCD_RAM;
	temp |= 0x20 ;
	LCD_REG=(0x22);//FNCR1
	LCD_RAM=(temp);
}
void Circle_Coordinate_Radius(u16 X,u16 Y,u16 R)
{
      
