fangling107/GL3150_V1.0/STM32_GL008A_CLJ260_V1.0/USER/src/RA8870.c
   LCD_REG=(0x99);
	LCD_RAM=(X);  
    LCD_REG=(0x9a);	   
	LCD_RAM=(X>>8);  
	   
    LCD_REG=(0x9b);
	LCD_RAM=(Y); 
    LCD_REG=(0x9c);	   
	LCD_RAM=(Y>>8);
 
    LCD_REG=(0x9d);
	LCD_RAM=(R);
}
/*
*********************************************************************************************************
*	函 数 名: RA8870_SetCursor
*	功能说明: 设置读显存的光标位置。 很多其他的控制器写光标和读光标是相同的寄存器，但是RA8875是不同的。
*	形    参:  _usX : X坐标; _usY: Y坐标
*	返 回 值: 无
*********************************************************************************************************
*/
static void RA8870_SetReadCursor(uint16_t _usX, uint16_t _usY)
{
	/* 设置内存读光标的坐标 */	
	LCD_REG=0x4A;
	LCD_RAM=_usX;	
	LCD_REG=0x4B;
	LCD_RAM=(_usX>>8);
	

	LCD_REG=0x4C;
	LCD_RAM=_usY;	
	LCD_REG=0x4D;
	LCD_RAM=(_usY >> 8);
}
/*
*********************************************************************************************************
*	函 数 名: RA8870_PutPixel
*	功能说明: 画1个像素
*	形    参:
*			_usX,_usY : 像素坐标
*			_usColor  :像素颜色
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8870_PutPixel(u16 X, u16 Y, u16 _usColor)
{		
	u8 temp;
	LCD_REG=0x46;
	LCD_RAM=X;	
  LCD_REG=0x47;	   
	LCD_RAM=X>>8;

	
  LCD_REG=0x48;
	LCD_RAM=Y;	 
  LCD_REG=0x49;	   
	LCD_RAM=(Y>>8);
	
	LCD_REG = 0x02;	
	temp=_usColor>>8;
	LCD_RAM=temp;
 	temp=_usColor;
 	LCD_RAM=temp;
}
/*
*********************************************************************************************************
*	函 数 名: RA8870_setpoint
*	功能说明: 设置显示区域
*	形    参:
*			_usX,_usY : 像素坐标
*			_usColor  :像素颜色
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8870_setpoint(u16 X, u16 Y)
{	
	LCD_REG=0x46;
	LCD_RAM=X;	
  LCD_REG=0x47;	   
	LCD_RAM=X>>8;

	
  LCD_REG=0x48;
	LCD_RAM=Y;	 
  LCD_REG=0x49;	   
	LCD_RAM=(Y>>8);

	LCD_REG = 0x02;	
		
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_GetPixel
*	功能说明: 读取1个像素
*	形    参:
*			_usX,_usY : 像素坐标
*			_usColor  :像素颜色
*	返 回 值: RGB颜色值
*********************************************************************************************************
*/
uint16_t RA8870_GetPixel(uint16_t _usX, uint16_t _usY)
{
	uint16_t usRGB;

	//RA8875_WriteReg(0x40, (1 << 0));	/* 设置为绘图模式，读取光标不自动加1 */
	LCD_REG=0x40; 
	LCD_RAM=(1 << 0);
	RA8870_SetReadCursor(_usX, _usY);	/* 设置读取光标位置 */	

	LCD_REG=0x02;
	usRGB = LCD_RAM;	/* 第1次读取数据丢弃 */
	usRGB = LCD_RAM;
	usRGB = LCD_RAM;
	return usRGB;
}
/*
*********************************************************************************************************
*	函 数 名: BTE_SetTarBlock
*	功能说明: 设置RA8875 BTE目标区块以及目标图层
*	形    参:
*			uint16_t _usX : 水平起点坐标
*			uint16_t _usY : 垂直起点坐标
*			uint16_t _usHeight : 区块高度
*			uint16_t _usWidth : 区块宽度
*			uint8_t _ucLayer : 0 图层1； 1 图层2
*	返 回 值: 无
*********************************************************************************************************
*/
void BTE_SetTarBlock(uint16_t _usX, uint16_t _usY, uint16_t _usHeight, uint16_t _usWidth, uint8_t _ucLayer)
{
	/* 设置起点坐标 */
	LCD_REG=0X58; LCD_RAM= _usX;
	LCD_REG=0X59; LCD_RAM= _usX>>8;
	LCD_REG=0X5A; LCD_RAM= _usY;
	
	if (_ucLayer == 0)	/* 图层2 */
	{
		LCD_REG=0X5B; LCD_RAM= _usY>>8;
	}
	else
	{
		LCD_REG=0X5B; LCD_RAM= (1 << 7) | (_usY >> 8);
	}

	/* 设置区块宽度 */
	LCD_REG=0X5C; LCD_RAM= _usWidth;
	LCD_REG=0X5D; LCD_RAM= _usWidth>>8;
	/* 设置区块高度 */
	LCD_REG=0X5E; LCD_RAM= _usHeight;
	LCD_REG=0X5F; LCD_RAM= _usHeight>>8;
	
}
/*
*********************************************************************************************************
*	函 数 名: BTE_SetOperateCode
*	功能说明: 设定BTE 操作码和光栅运算码
*	形    参: _ucOperate : 操作码
*	返 回 值: 无
*********************************************************************************************************
*/
void BTE_SetOperateCode(uint8_t _ucOperate)
{
	/*  设定BTE 操作码和光栅运算码  */
	LCD_REG=0X51; LCD_RAM= _ucOperate;
}
/*
*********************************************************************************************************
*	函 数 名: BTE_Start
*	功能说明: 启动BTE操作
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void BTE_Start(void)
{		
	LCD_REG=0X50; LCD_RAM= 0X80;
}
uint8_t RA8870_ReadStatus(void)
{
	uint8_t value = 0;	
	value = LCD_REG;
	return value;	
}
/*
*********************************************************************************************************
*	函 数 名: BTE_Wait
*	功能说明: 等待BTE操作结束
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void BTE_Wait(void)
{
 	while ((RA8870_ReadStatus() & 0x40) == 0x40);	
}
void BTE_ROP_Code(u8 CODE)
{
	 u8 temp;  
//	temp=CODE>>4;   
//    LCD_REG=(0x51);//BECR1
//	LCD_RAM=(temp);
	temp=CODE;   
  LCD_REG=(0x51);//BECR1	   
	LCD_RAM=(temp); 
}	
void BTE_enable(void)
{
	u8 temp;

	LCD_REG=(0x50);//BECR0
	temp = LCD_RAM;
	temp |= 0X80 ;
	LCD_REG=(0x50);//BECR0
	LCD_RAM=(temp);  
}
void Enable_TP(void)
{
// 	u8 temp;
// 	u8 a,b;
// 	a=0x40;
// 	b=0x04;
// 	LCD_REG=(0x70);
// 	temp=LCD_RAM;
// 	temp|=0x80;
// 	temp|=a;
// 	temp|=b;
// 	LCD_REG=(0x70);
// 	LCD_RAM=(temp);

	LCD_REG=(0x70);
	LCD_RAM=0x82;
}
void Set_4wire_TP(void)
{	u8 temp;
  LCD_REG=(0x71);//TPCR1	
	temp = LCD_RAM;
	temp |= 0x80;
	LCD_REG=(0x71);;//TPCR1
	LCD_RAM=(temp);
}
void TP_auto_mode(void)
{	u8 temp;
  	LCD_REG=(0x71);//TPCR1	
	temp = LCD_RAM;
	temp &= 0xbf;
	LCD_REG=(0x71);//TPCR1
	LCD_RAM=(temp);
}
void enable_TP_interrupt(void)
{ u8 temp;
  LCD_REG=(0x8F);//INTC
  temp=LCD_RAM; 
  temp |= 0x40;
  LCD_RAM=(temp);

 }
//清除中断标志位
void clear_TP_interrupt(void)
{ u8 temp;
  LCD_REG=0x8f;//INTC
  temp=LCD_RAM; 
  temp |=0X04;
  LCD_RAM=temp;

}
//触摸屏初始化
void RA8870_TouchInit(void)
{	

	Enable_TP();
	Set_4wire_TP();
	TP_auto_mode();
	Chk_Busy();
	enable_TP_interrupt();
	Memory_Clear();
	Chk_Busy();
	clear_TP_interrupt();
}

//==============================================================================
//Subroutine:	TP status
//==============================================================================
u8 Touch_Status(void)
{	u8 temp; 
	LCD_REG=(0x8f);//INTC	
	//Chk_Busy();
	temp = LCD_RAM;	
	if ((temp&0x04)==0x04)
		return 1;
	else 
		return 0;
}
void LcdPrint8bitBmp(const u8* image,u16 x,u16 y,u16 widht,u16 height)
{
	//u8  color8;
	u16 w,h;
	u8 temp;
	//u16 r,g,b;
   LCD_REG=(0x10);  //SYSR   u8[4:3]=00 256 color  u8[2:1]=  00 8u8 MPU interface
 	temp=LCD_RAM;
	temp&=0x03;
	temp|=0x30;
	LCD_REG=(0x10); 
	LCD_RAM=temp;     //256色(RRRGGGBB) 
	Delay1ms(10);
	Active_Window(x,x+widht,y,y+height);
	for(h=0;h<height;h++)
	{
		XY_Coordinate(x,y+h);
		LCD_REG=(0x02);		//MRWC  REG[02h] -- Memory Read/Write Command
		for(w = 0; w< widht; w++)
		{
			LCD_RAM=(*image++);		
			Chk_Busy();
		}
	}
 	LCD_REG=(0x10);  //SYSR   u8[4:3]=00 256 color  u8[2:1]=  00 8u8 MPU interface
	temp=LCD_RAM;
	temp|=0x0F;
	LCD_REG=(0x10);
	LCD_RAM=temp;     //65535色 
	Delay1ms(1);
}
/**************************************************************************************
函数功能：	画水平直线
输入	：  WORD  x    		起点的横坐标
	  		WORD  y  	    起点的纵坐标
	  		WORD  width		直线长度
	  		WORD  color		颜色
输出	：	无
**************************************************************************************/
void LcdPrintHorz(u16 x, u16 y, u16 width, u16 color)
{
	Active_Window(0,480,0,272);
	Text_Foreground_Color(color); // 设定颜色 
	Geometric_Coordinate(x,x+width-1,y,y); // 设置水平线起始点
	LCD_REG=(0x90);//写0x90寄存器
	LCD_RAM=(0x80);   //向0x90寄存器写数据
	Chk_Busy();
}
/**************************************************************************************
函数功能：  画垂直直线
输入	：  u16  x    	    起点的横坐标
	  		u16  y  	    起点的纵坐标
	  		u16  height		直线高度
	  		u16  color		颜色
输出	：	无
**************************************************************************************/
void LcdPrintVert(u16 x, u16 y, u16 height, u16 color)
{
	Active_Window(0,480,0,272);
	Text_Foreground_Color(color); // 设定颜色 
	Geometric_Coordinate(x,x,y,y+height-1); // 设置起始点坐标
	LCD_REG=(0x90);//写0x90寄存器
	LCD_RAM=(0x80);   //向0x90寄存器写数据
	Chk_Busy();
}



/**************************************************************************************
功能描述: 在屏幕显示一输入框,有立体感的
输    入: u16 x1,y1,x2,y2 按钮框左上角和右下角坐标
输    出: 无
**************************************************************************************/
void DisplayEdit(u16 x1,u16 y1,u16 x2,u16 y2,u16 color)
{
	LcdPrintHorz(x1,  y1,  x2 - x1+1, color_grey2);
	LcdPrintHorz(x1+1,y1+1,x2 - x1-1, color_grey1);
	LcdPrintVert(x1,  y1,  y2 - y1+1, color_grey2);
	LcdPrintVert(x1+1,y1+1,y2 - y1-1, color_grey1);
	LcdPrintHorz(x1,  y2,  x2 - x1+1, color_white);
	LcdPrintVert(x2,  y1,  y2 - y1+1, color_white);
	LcdFillRec(  x1+2,y1+2,x2 - 1, y2-1,1,color);
}
/**************************************************************************************
功能描述: 在屏幕显示一凹下的按钮框
输    入: u16 x1,y1,x2,y2 按钮框左上角和右下角坐标
输    出: 无
**************************************************************************************/
void DisplayButtonDown(u16 x1,u16 y1,u16 x2,u16 y2)
{
	LcdPrintHorz(x1,  y1,  x2 - x1+1, color_grey2);
	LcdPrintHorz(x1+1,y1+1,x2 - x1-1, color_grey1);
	LcdPrintVert(x1,  y1,  y2 - y1+1, color_grey2);
	LcdPrintVert(x1+1,y1+1,y2 - y1-1, color_grey1);
	LcdPrintHorz(x1,  y2,  x2 - x1+1, color_grey2);
	LcdPrintVert(x2,  y1,  y2 - y1+1, color_grey1);
}
void DisplayButtonUp(u16 x1,u16 y1,u16 x2,u16 y2)
{
	LcdPrintHorz(x1,  y1,  x2 - x1+1, color_grey1);
	LcdPrintVert(x1,  y1,  y2 - y1+1, color_grey2);
	
