fangling107/GL3150_V1.0/STM32_GL008A_CLJ260_V1.0/USER/src/RA8870.c
	LcdPrintHorz(x1+1,y2-1,x2 - x1-1, color_grey1);
	LcdPrintHorz(x1,  y2,  x2 - x1+1, color_grey2);
	LcdPrintVert(x2-1,y1+1,y2 - y1-1, color_grey1);
  LcdPrintVert(x2  ,y1  ,y2 - y1+1, color_grey2);
}
//键盘的按钮
void DisplayButton(u16 x1,u16 y1,u16 x2,u16 y2)
{
	LcdPrintHorz(x1,  y1,  x2 - x1+1, color_grey1);
	LcdPrintVert(x1,  y1,  y2 - y1+1, color_grey2);
	
	LcdPrintHorz(x1+1,y2-1,x2 - x1-1, color_grey1);
	LcdPrintHorz(x1,  y2,  x2 - x1+1, color_grey2);
	LcdPrintVert(x2-1,y1+1,y2 - y1-1, color_grey1);
  LcdPrintVert(x2  ,y1  ,y2 - y1+1, color_grey2);
	LcdFillRec(x1+2,y1+2,x2-2,y2-2,1,color_cyan);
	
}
/********************************************************************/
//函数功能：放置按键
//(x,y)矩形按键中心坐标
//len:按键长度
//wid:按键宽度
/********************************************************************/
void Put_AnJian(u16 x, u16 y, u16 len, u16 wid)
{
	u16 lx_inside, ly_inside, rx_inside, ry_inside;
	Active_Window(0,479,0,271);	
	//显示图片
	Graphic_Mode();
	lx_inside = x - len/2;
	ly_inside = y - wid/2;
	rx_inside = x + len/2;
	ry_inside = y + wid/2;	
	LcdFillRec(lx_inside,ly_inside,rx_inside,ry_inside,1,color_cyan);
	
	LcdFillRec(lx_inside-1, ly_inside-1, lx_inside-1, ry_inside+1,1, color_grey2);	//画左垂直边框线,汪色
	LcdFillRec(lx_inside-2, ly_inside-2, lx_inside-2, ry_inside+2,1, color_grey2);
	LcdFillRec(lx_inside-3, ly_inside-3, lx_inside-3, ry_inside+3,1,color_grey2);
	
	LcdFillRec(lx_inside-1, ly_inside-1, rx_inside+1, ly_inside-1,1, color_grey2);	//画上边框线,浅色
	LcdFillRec(lx_inside-2, ly_inside-2, rx_inside+2, ly_inside-2,1,color_grey2);
	LcdFillRec(lx_inside-3, ly_inside-3, rx_inside+3, ly_inside-3,1, color_grey2);	

	LcdFillRec(rx_inside+1, ly_inside,   rx_inside+1, ry_inside+1,1, color_grey1);		//画右垂直边框线,深色
	LcdFillRec(rx_inside+2, ly_inside-1, rx_inside+2, ry_inside+2,1,color_grey1);
	LcdFillRec(rx_inside+3, ly_inside-2, rx_inside+3, ry_inside+3,1, color_grey1);
	
	LcdFillRec(lx_inside-1, ry_inside,   rx_inside+1, ry_inside-1,1, color_grey1);		//画下边框线,深色
	LcdFillRec(lx_inside-2, ry_inside+1, rx_inside+2, ry_inside+2,1, color_grey1);
	LcdFillRec(lx_inside-3, ry_inside+2, rx_inside+3, ry_inside+3,1, color_grey1);	
	/*if (len > 50) //当按键长度大于50时，边框线变宽
	{
		LcdFillRec(lx_inside-4, ly_inside-4, lx_inside-4, ry_inside+4,1, color_grey2); //画左垂直边框线,浅色
		LcdFillRec(lx_inside-5, ly_inside-5, lx_inside-5, ry_inside+5,1, color_grey2);
		LcdFillRec(lx_inside-6, ly_inside-6, lx_inside-6, ry_inside+6,1, color_grey2);
	
		LcdFillRec(lx_inside-4, ly_inside-4, rx_inside+4, ly_inside-4,1, color_grey2); //画上边框线,浅色
		LcdFillRec(lx_inside-5, ly_inside-5, rx_inside+5, ly_inside-5,1, color_grey2);
		LcdFillRec(lx_inside-6, ly_inside-6, rx_inside+6, ly_inside-6,1, color_grey2);
	
		LcdFillRec(rx_inside+4, ly_inside-3, rx_inside+4, ry_inside+4,1, color_grey1);	//画右垂直边框线,深色
		LcdFillRec(rx_inside+5, ly_inside-4, rx_inside+5, ry_inside+5,1, color_grey1);
		LcdFillRec(rx_inside+6, ly_inside-5, rx_inside+6, ry_inside+6,1, color_grey1);
	
		LcdFillRec(lx_inside-4, ry_inside+3, rx_inside+4, ry_inside+4,1, color_grey1);	 //画下边框线,深色
		LcdFillRec(lx_inside-5, ry_inside+4, rx_inside+5, ry_inside+5,1, color_grey1);
		LcdFillRec(lx_inside-6, ry_inside+5, rx_inside+6, ry_inside+6,1, color_grey1);
	}*/
	Text_Mode();	
}
void AnJianPressed(u16 x, u16 y, u16 len, u16 wid)
{
	u16 lx_inside, ly_inside, rx_inside, ry_inside;
	Active_Window(0,479,0,271);	
	//显示图片
	Graphic_Mode();
	lx_inside = x - len/2;
	ly_inside = y - wid/2;
	rx_inside = x + len/2;
	ry_inside = y + wid/2;
	LcdFillRec(lx_inside,ly_inside,rx_inside,ry_inside,1,color_cyan); 						//按键主颜色

	LcdFillRec(lx_inside-1, ly_inside-1, lx_inside-1, ry_inside+1,1, color_grey1);	//画左垂直边框线
	LcdFillRec(lx_inside-2, ly_inside-2, lx_inside-2, ry_inside+2,1, color_grey1);
	LcdFillRec(lx_inside-3, ly_inside-3, lx_inside-3, ry_inside+3,1, color_grey1);

	LcdFillRec(lx_inside-1, ly_inside-1, rx_inside+1, ly_inside-1,1, color_grey1);	//画上边框线
	LcdFillRec(lx_inside-2, ly_inside-2, rx_inside+2, ly_inside-2,1, color_grey1);
	LcdFillRec(lx_inside-3, ly_inside-3, rx_inside+3, ly_inside-3,1, color_grey1);
	
	LcdFillRec(rx_inside+1, ly_inside,   rx_inside+1, ry_inside+1,1, color_grey2);	//画右垂直边框线
	LcdFillRec(rx_inside+2, ly_inside-1, rx_inside+2, ry_inside+2,1, color_grey2);
	LcdFillRec(rx_inside+3, ly_inside-2, rx_inside+3, ry_inside+3,1, color_grey2);
	
	LcdFillRec(lx_inside-1, ry_inside,   rx_inside+1, ry_inside-1,1, color_grey2);	//画下边框线
	LcdFillRec(lx_inside-2, ry_inside+1, rx_inside+2, ry_inside+2,1, color_grey2);
	LcdFillRec(lx_inside-3, ry_inside+2, rx_inside+3, ry_inside+3,1, color_grey2);
	/*if (len > 50)  //当按键长度大于50时，边框线变宽
	{
		LcdFillRec(lx_inside-4, ly_inside-4, lx_inside-4, ry_inside+4,1, color_grey1);	//画左垂直边框线
		LcdFillRec(lx_inside-5, ly_inside-5, lx_inside-5, ry_inside+5,1, color_grey1);
		LcdFillRec(lx_inside-6, ly_inside-6, lx_inside-6, ry_inside+6,1,color_grey1);

		LcdFillRec(lx_inside-4, ly_inside-4, rx_inside+4, ly_inside-4,1, color_grey1);	//画上边框线
		LcdFillRec(lx_inside-5, ly_inside-5, rx_inside+5, ly_inside-5,1, color_grey1);
		LcdFillRec(lx_inside-6, ly_inside-6, rx_inside+6, ly_inside-6,1, color_grey1);

		LcdFillRec(rx_inside+4, ly_inside-3, rx_inside+4, ry_inside+4,1, color_grey2); //画右垂直边框线
		LcdFillRec(rx_inside+5, ly_inside-4, rx_inside+5, ry_inside+5,1, color_grey2);
		LcdFillRec(rx_inside+6, ly_inside-5, rx_inside+6, ry_inside+6,1, color_grey2);

		LcdFillRec(lx_inside-4, ry_inside+3, rx_inside+4, ry_inside+4,1, color_grey2); //画下边框线
		LcdFillRec(lx_inside-5, ry_inside+4, rx_inside+5, ry_inside+5,1, color_grey2);
		LcdFillRec(lx_inside-6, ry_inside+5, rx_inside+6, ry_inside+6,1, color_grey2); 	
	}*/
		Text_Mode();
}
//显示时间和日期
void display_time(void)
{
	u8 t;		
	if(t!=calendar.sec)
		{
			t=calendar.sec;	
			Text_Foreground_Color(color_blue);
			Text_Background_Color(color_cyan);//设定文字的前景色和背景色
			sprintf(Data,"%04d-%02d-%02d",calendar.w_year,calendar.w_month,calendar.w_date);
			XY_Coordinate(380,17);
			Show_StringNum(Data,10);
			sprintf(Time,"%02d:%02d:%02d",calendar.hour,calendar.min,calendar.sec);
			XY_Coordinate(385,32);
			Show_StringNum(Time,8);	
		}	
 		Delay1ms(10);	
}
